background_zone/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wall
    {
        type            patch;
        nFaces          20000;
        startFace       2703341;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       2723341;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2500;
        startFace       2725841;
    }
    oversetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          21000;
        startFace       2728341;
    }
    seed
    {
        type            wall;
        inGroups        2(seed wall);
        nFaces          135399;
        startFace       2749341;
    }
)

// ************************************************************************* //
