background_zone/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset
    {
        type            overset;
    }

    seed
    {
        type            fixedValue;
        value           uniform (0 0 0);  // No-slip condition
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.8);  // Constant inlet velocity
    }

    outlet
    {
        type            zeroGradient;  // Allows outflow
    }
    
    wall
    {
        type            slip;  // Zero-shear condition
    }
}
