background_zone/system/maxCo0.10
maxCo           0.1;
